export default function AboutPage() {
  return (
    <section className="about-page">
      <div className="container">
        <h2 className="title-aboutPage">Про нас</h2>
        <div>
          <h3 className="title-text">
            Хокейний Клуб «Ягуар» - команди 2010-2012 та 2013-2014 років
            народження
          </h3>
          <p className="about-text">
            ХК «Ягуар» - це клуб, що створює сприятливі умови для всебічного
            розвитку молодих спортсменів. Кожен гравець має можливість
            вдосконалювати свої навички, розвиватися фізично та морально,
            ставати сильнішим як на льоду, так і поза ним. Наш клуб поєднує
            професіоналізм із дружньою атмосферою, де цінуються індивідуальні
            якості та командний дух. Детальна інформація про тренувальний
            процес, календар заходів, фото та відеоматеріали доступні на нашому
            офіційному сайті: https://jaguars-nine.vercel.app/.
          </p>
          <h4 className="title-mini-text">Наша мета</h4>
          <p className="about-text">
            Ми прагнемо підтримувати інтерес до хокею серед молоді, сприяючи
            розвитку техніки катання, командної взаємодії, а також стійкості до
            складнощів і викликів. Наш клуб формує конкурентну, але водночас
            дружню атмосферу, де повага до партнерів по команді є основою
            успіху.
          </p>
          <h4 className="title-mini-text">Досягнення та діяльність</h4>
          <p className="about-text">
            Ми проводимо регулярні тренування, з особливим акцентом на базові
            навички: катання на льоду, передачу шайби, контроль над нею. Участь
            у матчах і турнірах дає можливість гравцям винищувати свій потенціал
            і здобувати досвід. Особлива гордість клубу дівчата, що стояли біля
            витоків команди і мають численні досягнення, зокрема, представлення
            України у збірній на міжнародних змаганнях у Канаді. У сезоні
            2024-2025 команда «Ягуар» стала бронзовим призером Чемпіонату
            України серед юнаків 2013-2014 років народження. У сезоні 2025-2026
            команди U13 і U16 продовжують гідно представляти клуб на чемпіонаті
            України.
          </p>
          <h4 className="title-mini-text">Чому обирають нас</h4>
          <p className="about-text">
            Наш тренерський склад має значний досвід роботи з молодими
            спортсменами та забезпечує індивідуальний підхід до кожного гравця.
            Для нас кожен учасник - це не просто номер на формі, а особистість
            зі своїми сильними і унікальними рисами. Ми створюємо атмосферу, де
            друзі стають справжніми товаришами по команді, а тренування - не
            лише важка праця, а й справжнє задоволення.
          </p>
          <h4 className="title-mini-text">Запрошення</h4>
          <p className="about-text">
            Запрошуємо батьків дітей 2010-2012 та 2013-2014 років народження
            приєднатися до нашої хокейної родини. Якщо ваша дитина бажає
            спробувати себе у хокеї, ми відкриті до нових талантів і готові
            підтримати їхній розвиток. Контактна інформація та деталі доступні
            на нашому сайті: https://jaguars-nine.vercel.app/.
          </p>
          <br></br>
          <p className="about-text">
            Дякуємо всім, хто підтримує нашу команду. Разом ми рухаємося до
            нових спортивних вершин!
          </p>
        </div>
      </div>
    </section>
  );
}