import React from 'react'
import '../styles/Coach.css'

const Coach = () => {
  return (
    <section id="coach" className="coach">
      <div className="container">
        <h2 className="section-title">Головний тренер</h2>
        <div className="coach-content">
          <div className="coach-image">
            <div className="placeholder-wrap">
              <div className="placeholder-image">
                <img src="/84.jpg" alt="Coach" />
              </div>
              <div className="placeholder-image">
                <img src="/Yak1.png" alt="Coach" />
              </div>
            </div>
          </div>
          <div className="coach-bio">
            <h3>Дмитро Вікторович Якушин</h3>
            <p className="coach-position">Головний тренер</p>
            <p className="coach-description">
              Дмитро Вікторович Якушин - досвідчений тренер з більш ніж
              15-річним стажем роботи. Тренер команди «Ягуари» 2013-2014 року
              народження (U13) і 2010 року народження (U16). Вихованець СДЮШОР
              Харків. У сезоні 1994-95, у 18 років, дебютував у CJHL за «Пембрук
              Ламбер Кінгс» - 31 матч, 13 очок. 22 червня 1996 року був обраний
              «Торонто Мейпл-Ліфс» у 6 раунді, №140 драфту НХЛ 1996. WHL:
              «Едмонтон Айс» 1996-97 - 63 гри, 17 очок; 1997-98 - 29 ігор, 11
              очок. У тому ж сезоні ЗХЛ - «Реджайна Петс» - 13 ігор, 14 очок;
              плей-оф - 9 матчів, 2+8. Команда завершила сезон першою у Східному
              дивізіоні, у плей-оф: 4:0 проти «Муз-Джо Ворріорс», 1:4 проти
              «Брендон Віт-Кінгс». AHL: «Сент-Джонс Мейпл-Ліфс» 1998–99 - 71
              гра, 2+6; 1999–00 - 64 гри, 1+13; 2000–01 - 45 матчів, 2 голи.
              НХЛ: дебютував 29 листопада 1999 року за «Торонто Мейпл-Ліфс» у
              матчі проти «Вашингтон Кепіталс» - перемога 3:1. Загалом провів 2
              матчі в НХЛ. 26 вересня 2000 року повернений до «Сент-Джонс».{" "}
              <br></br>
              Після завершення ігрової кар’єри Дмитро Вікторович зосередився на
              тренерській роботі, передаючи молодим хокеїстам свій багатий
              досвід гри на міжнародному рівні. Його тренерський стиль поєднує
              канадську школу хокею з українською дисципліною, що дозволяє
              виховувати гравців з глибоким розумінням гри, технікою і
              характером. Під його керівництвом юнацькі команди демонструють
              стабільний прогрес і беруть участь у престижних турнірах в Україні
              та за кордоном. <br></br>
              Під керівництвом Дмитра Вікторовича юні хокеїсти не лише
              здобувають технічні навички, а й формують характер переможців.
              Його вихованці мріють про великі арени - і вже сьогодні
              демонструють гру, гідну міжнародного рівня. Дехто з них отримує
              запрошення на перегляд у хокейні академії, бере участь у
              міжнародних турнірах. Це покоління має всі шанси стати новою
              хвилею українського хокею - і саме такі тренери, як Якушин,
              відкривають їм шлях до великого спорту.
            </p>
          </div>
        </div>
      </div>
    </section>
  );
}

export default Coach