import React from 'react'
import '../styles/GoalkeeperCoach.css';

const GoalkeeperCoach = () => {
  return (
    <section id="goalkeeper" className="goalkeeper">
      <div className="container">
        <h2 className="goalkeeper-title">Тренер воротарів</h2>
        <div className="goalkeeper-content">
          <div className="goalkeeper-image">
            <div className="placeholder-wrap">
              <div className="placeholder-imageGoalkeeper">
                <img src="/H.png" alt="Coach goalkeeper" />
              </div>
              <div className="placeholder-imageGoalkeeper">
                <img src="/Haritonov1.jpg" alt="Coach goalkeeper" />
              </div>
              <div>
                <img src="/Haritonov2.jpg" alt="Coach goalkeeper" />
              </div>
            </div>
          </div>
          <div className="goalkeeper-bio">
            <h3>Олександр Харитонов</h3>
            <p className="goalkeeper-position">Тренер воротарів</p>

            <p className="goalkeeper-description">
              Олександр Харитонов - український воротар і тренер, який присвятив
              своє життя розвитку юнацького хокею в Україні. Олександр Харитонов
              народився в Україні та пройшов хокейну школу в Харкові - одному з
              центрів розвитку хокею на Сході країни. Як воротар, він грав на
              професійному рівні, зокрема в українських клубах, де
              зарекомендував себе як надійний і дисциплінований гравець. Його
              кар’єра охоплює період активного розвитку українського хокею, коли
              формувались перші стабільні клуби та ліги. Після завершення
              ігрової кар’єри Харитонов перейшов до тренерської діяльності,
              зосередившись на роботі з дітьми та юнаками. Наразі він є тренером
              у місті Дніпро, де очолює команди «Ягуари» 2013-2014 року
              народження, а також працює з групою дітей 2010 року. Його підхід
              до тренувань поєднує технічну дисципліну, психологічну підтримку
              та розвиток командного духу. Особливу увагу Харитонов приділяє
              воротарській школі - він не просто тренує, а формує нове покоління
              українських голкіперів, передаючи їм власний досвід, знання та
              мотивацію. Його вихованці регулярно беруть участь у всеукраїнських
              турнірах, демонструючи високий рівень підготовки. Харитонов
              активно співпрацює з батьками спортсменів, підтримує їхню участь у
              розвитку дітей і створює атмосферу довіри та партнерства.{" "}
              <br></br> Його робота - це не просто тренерство, а вклад у
              майбутнє українського хокею. Після завершення ігрової кар’єри
              Харитонов перейшов до тренерської діяльності, зосередившись на
              роботі з дітьми та юнаками. Наразі він є тренером у місті Дніпро,
              де очолює команди «Ягуари» 2013-2014 року народження, а також
              працює з групою дітей 2010 року. Його підхід до тренувань поєднує
              технічну дисципліну, психологічну підтримку та розвиток командного
              духу. Особливу увагу Харитонов приділяє воротарській школі - він
              не просто тренує, а формує нове покоління українських голкіперів,
              передаючи їм власний досвід, знання та мотивацію. Його вихованці
              регулярно беруть участь у всеукраїнських турнірах, демонструючи
              високий рівень підготовки. Харитонов активно співпрацює з батьками
              спортсменів, підтримує їхню участь у розвитку дітей і створює
              атмосферу довіри та партнерства. Його робота - це не просто
              тренерство, а вклад у майбутнє українського хокею.
            </p>
          </div>
        </div>
      </div>
    </section>
  );
}

export default GoalkeeperCoach;